# CreateRoofStyle

## Description
Creates a new Roof Style of the given name. If the name is already in use, the next available name will be used.

```pascal
FUNCTION CreateRoofStyle(roofStyleName : STRING) : HANDLE;
```

```python

def vs.CreateRoofStyle(roofStyleName):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofStyleName|STRING|The name of the new Roof Style.  If the name is already in use, the next available name will be used.|

## Returns
The new Roof Style.

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Architectural